app/views/jobs/_job.html.erb

<p>
    <%= pluralize(job.comments.size, "comment") %>
---
SELECT COUNT(*) FROM `comments` WHERE `comments`.`job_id` = 2