app/controllers/comments_controller.rb

INSERT INTO `comments` (`name`, `body`, `job_id`, `created_at`, `updated_at`) VALUES ('123', '123', 5, '2015-04-01 17:16:21', '2015-04-01 17:16:21')
---
  def create
    @comment = Comment.new(comment_params)
    @comment.job = Job.find(params[:job_id])
    if @comment.save