app/controllers/companies_controller.rb

INSERT INTO `companies` (`name`, `email`, `encrypted_password`, `created_at`, `updated_at`) VALUES ('Samuel', 'teste@teste.com', '$2a$10$nJmCwkhYkhFiJsQYV1VZ/O1jhJsitK7LpuKRw9sSX30Y1nCp0MVQi', '2015-04-01 19:09:17', '2015-04-01 19:09:17')
---
  def create
    @company = Company.new(companies_params)

    if @company.save