app/controllers/jobs_controller.rb

  def premium
    @jobs = Job.where(premium: true).includes(:company).order("created_at DESC").page(params[:page]).per(3)
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` IN (3)