app/controllers/login_controller.rb

  def create
    company = Company.find_by_email(params[:company][:email])
---
SELECT  `companies`.* FROM `companies` WHERE `companies`.`email` = 'samuel' LIMIT 1